{"lang":"ENG","ko":"Korean","en":"English","ja":"Japanese","cht":"Chat","mbr":"Members","stg":"Setting","home":"Home","exit":"Exit","cquit":"Quit","exitep":"If you exit, All data will be lost. Are you sure you want to exit?","exitas":"What if you send a message to the developer to ask for help? or, save the chat log :)","cun":"Change Username","ccn":"Change Chat Name","mr":"More","prfp":"Add Profile Picture","op":"Open","cls":"Close","nch":"Chat","ngch":"Group Chat","src":"Search here...","sdnmsg":"Send a message","sdnpht":"Send a photo","cld":"Check calender","vprf":"View Profile","addm":"Invite more members","csts":"Connection State","itrC":"Send a message to start chatting.","empt":"Empty","ukn":"Unknown","chd":"Checked","prep":"This section is under development. Please wait.","uppr":"Upload your image","sun":"Sun","mon":"Mon","tue":"Tue","wed":"Wed","thu":"Thu","fri":"Fri","sat":"Sat","nevt":"No event","tup":"User profile","vinf":"Portfolio information","gb":"Go back","nf":"Not found","cl":"Change Languages","dkmd":"Change Theme","dkmdl":"Light Theme","dkmdd":"Dark Theme","dkmds":"System Theme","intro":"Who I Am","education":"Education","experience":"Experience","skills":"Skills and Expertise","projects":"Projects","teamp":"Team Projects","presentations":"Presentations or Publications","personality":"Interests and Hobbies","toc":"Table of Contents","ist":"Instagram","ghb":"GitHub","aj":"Ask developer","sem":"Contact","sems":"Email has been successfully sent.","semf":"Too many emails or Invalid content. Try again later.","lks":"Links","sq":"Send a question","sd":"Send","web":"Write the email body here...","wrf":"Where are you from? :)","kjy":"Juyeon Kim","sj":"Saitama, Japan","itr":"Hi there! I'm Juyeon Kim, a dedicated Node.js developer with a passion for programming and a deep understanding of economic principles. Currently pursuing my studies in Economy at Saitama University, I merge my technical expertise with domain knowledge to create innovative solutions at the intersection of technology and economics.","us":"University Student","bch":"Bachelor of Economics","rcw":"Relevant Coursework","jpro":"Janpara Omiya","rka":"Republic of Korea Army","uqsm":"Uniqlo Queen Street Mall","cien":"Cross-Industry Experience","fsdm":"Full Stack Development","lsls":"Languages","susj":"Saitama University, Saitama, Japan","egdm":"Expected Graduation Date: March 2025","ecan":"Economic Analysis","bsin":"Business Innovation","nvag":"November 2018 - August 2019","omsj":"Omiya, Saitama, Japan","fese":"Febrary 2020 - September 2021","pgrk":"Paju-si, Gyeonggi-do, Republic of Korea","pgr1":"Febrary 2022 - September 2022","pgr2":"170 Queen St, Brisbane City QLD 4000","pgr3":"Bachelor of Economics","pgr4":"Web Development Experience","pgr5":"Node.js/JavaScript: 2 years","pgr6":"HTML/CSS: 2 years","pgr7":"AWS/Docker/Git: 1 year","pgr8":"C++/Swift: 6 months","vmd":"\"Vitmenu\" is my very first project. It is a web application that provides a platform for users to create and share their own service. The application is built with Node.js, Express, and PostgreSQL. The front-end is built with HTML, CSS, and JavaScript, mainly running with React.js. The application is deployed on AWS EC2 and Docker containers. The application is currently under development. Feel free to check it out, or ask me about it in the chat!","vmdpf":"This website \"portfolio.vitmenu.com\" is made for the chat feature which is intended to answer questions about me on behalf of the developer when the developer is not available, so that you can get to know me better in realtime, and I can get to know you better too. If you have any questions, please feel free to chat. Thank you.","zi":"Zoom in","hb1":"Computer Science Study","hb1desc":"I enjoyed creating UMS maps, a sub-game of the game StarCraft, using an editor app from a young age. I found coding interesting and wanted to study it more deeply. Therefore, I am acquiring computer science knowledge based on internet information, regardless of my degree in economics. I am also interested in fields such as blockchain, artificial intelligence, big data, and data science, and I enjoy solving algorithm problems through sites like LeetCode and implementing original ideas into web applications.","hb2":"Gym, Swimming, and European League Soccer","hb2desc":"When I focus on studying, I spend a lot of time sitting in one position for a long time, so I reward myself by moving my body. Sometimes I go to the gym with friends or enjoy watching European league soccer games. I also enjoyed going to the swimming pool with friends from a young age, and I still maintain that habit.","hb3":"Learning Languages","hb3desc":"From attending university in Japan to participating in a working holiday, I enjoy experiencing various places and challenging myself with their cultures and lifestyles. Through these experiences, I aim to interact with diverse people, understand their thoughts and cultures, and gain a global perspective. Additionally, I enjoy learning different languages to communicate with various people.","hb4":"???","hb4desc":"Ask me in the chat :)","li1":"Talk to your team or the same company members","li2":"Send images, videos, and files","li3":"Make schedules and set reminders","sfi":"Sorry for interupting...","mrag":"It seems like you have reached the limitation of requests you can make as a guest user. Register your company to continue.","mrag1":"It seems like you have reached the maximum number of requests you can make. Please wait a moment.","tcpe":"Type your company name and press enter key","ni":"Not interested","ierr1":"Please enter the name of the company or organization.","ierr2":"We couldn't find the matching page for you. Please try again.","lia":"Log in as","tfu":"Thank you for visiting my portfolio!","rgst":"You will be able to","rgst1":"Have you enjoyed","ftes1":"#1. Structure","pled2":"#2. Planned","sor":"#1. So far","frow":"#2. From now","lid0":"This portfolio features a simple chat app functionality and includes a unique aspect where, if I (the main character of the website) am not available, an assistant can act on my behalf. If you have any questions, the assistant will answer based on the resume I have prepared.","lid3":"It is planned to create a feature which analyses the content of user messages to understand their intentions and activate appropriate system actions. For instance, if a user's text message is related to scheduling, the AI will assist in creating the schedule, enabling more flexible interactions.","lid6":"Up until now, I have acquired foundational knowledge of TCP/IP and a web development tech stack centered around JavaScript to achieve the aforementioned objectives. Additionally, I have studied Docker and AWS services for hosting and deployment, as well as SQL and entity design methods through normalization for data management.","lid9":"My future goals, to be achieved by March 2025 before graduation, include learning the concepts of CI/CD to improve development and deployment speed, integrating payment APIs to activate the service as one with user permissions set by various plans, and ensuring stable operation as a paid service by performing server load testing using Apache Benchmark or JMeter.","wcpf":"Welcome to Vitmenu chat!","fbam":"Feel free to browse around and ask me anything you want to know about me.","qstn":"???","wsnw":"Update","lodn":"Loading","savd":"Saved","erro":"Error","rdmr":"Read more","dvlg":"Devlog","update":"Company users can upload their profile photo now.","info":"This portfolio website is made by Juyeon Kim. I am a full-stack developer who is passionate about creating web applications. I am currently looking for a job opportunity. If you are interested in me, please contact me. Thank you.","err":{"40":"Bad request","41":"Unauthorized","44":"Not found","50":"Interval server error","429":"Too many requests"},"mesg":{"tbf":"File is too large, please upload a file smaller than 5MB.","dcl":"Request declined. try again later."},"itrp0":"","educ0":"","expe0":"","skil0":"","achv0":"","prst0":"","psnl0":""}